//************************************************************************
// File Name: E.cpp
// Author: Shili_Xu
// E-Mail: shili_xu@qq.com 
// Created Time: 2018年04月01日 星期日 21时21分41秒
//************************************************************************

#include <cstdio>
#include <cstring>
#include <algorithm>
using namespace std;

const int MON[2][13] = {
	{0, 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31},
	{0, 31, 29, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31}
};

char s[20];
int d, m, y;
int d1, m1, d2, m2, d3, m3;

bool leap(int y)
{
	return (y % 4 == 0 && y % 100 != 0 || y % 400 == 0);
}

int main()
{
	scanf("%s", s);
	d = d3 = (s[0] - '0') * 10 + (s[1] - '0');
	m = m3 = (s[3] - '0') * 10 + (s[4] - '0');
	y = (s[6] - '0') * 1000 + (s[7] - '0') * 100 + (s[8] - '0') * 10 + (s[9] - '0');
	scanf("%s", s);
	d1 = (s[0] - '0') * 10 + (s[1] - '0');
	m1 = (s[3] - '0') * 10 + (s[4] - '0');
	scanf("%s", s);
	d2 = (s[0] - '0') * 10 + (s[1] - '0');
	m2 = (s[3] - '0') * 10 + (s[4] - '0');	
	int ans = 0;
	for (int i = 1; i <= 2048; i++) {
		d++;
		if (d > MON[leap(y)][m]) d = 1, m++;
		if (m > 12) m = 1, y++;
		if (i % 100 == 0 || (d == d1 && m == m1) || (d == d2 && m == m2) || (d == d3 && m == m3)) ans++;	
	}
	printf("%d\n", ans);
	return 0;
}
